# SQL Joins: TMDb Database
© Explore Data Science Academy

## Instructions to Students

This challenge is designed to determine how much you have learned so far and will test your knowledge on join SQL statements.

The answers for this challenge should be selected on Athena for each corresponding Multiple Choice Question. The questions are included in this notebook and are numbered according to the Athena Questions, the options to choose from for each question have also been included.

Do not add or remove cells in this notebook. Do not edit or remove the `%%sql` comment as it is required to run each cell.

**_Good Luck!_**

## Honour Code

I ADEWALE DANIEL, ODUKOYA, confirm - by submitting this document - that the solutions in this notebook are a result of my own work and that I abide by the EDSA honour code (https://drive.google.com/file/d/1QDCjGZJ8-FmJE3bZdIQNwnJyQKPhHZBn/view?usp=sharing).

Non-compliance with the honour code constitutes a material breach of contract.

## The TMDb Database

In this challenge you will be exploring the [The Movie Database](https://www.themoviedb.org/) - an online movie and TV show database, which houses some of the most popular movies and TV shows at your finger tips. The TMDb database supports 39 official languages used in over 180 countries daily and dates all the way back to 2008. 


<img src="https://github.com/Explore-AI/Pictures/blob/master/sql_tmdb.jpg?raw=true" width=80%/>


Below is an Entity Relationship diagram(ERD) of the TMDb database:

<img src="https://github.com/Explore-AI/Pictures/blob/master/TMDB_ER_diagram.png?raw=true" width=70%/>

As can be seen from the ER diagram, the TMDb database consists of `14 tables` containing information about movies, cast, genre and so much more.  

Let's get started!

## Loading the database

To begin and start making use of SQL queries you need to prepare your SQL environment you can do this by loading in the magic command `%load_ext sql`, next you can go ahead and load in your database. To do this you will need to ensure you have downloaded the `TMDB.db`sqlite file from Athena and have stored it in a known location. Now that you have all the prerequisites you can go ahead and load it into the notebook.

In [1]:
%load_ext sql

In [2]:
%%sql 

sqlite:///TMDB.db

## Questions on SQL Join Statements 

Use the given cell below each question to execute your SQL queries to find the correct input from the options provided for the multiple choice questions on Athena.

**Question 1**

What is the primary key for the table “movies”?

**Options:** 
 - title
 - movie_key
 - film_id
 - movie_id

**Solution**

In [3]:
%%sql 
pragma table_info ('movies');

 * sqlite:///TMDB.db
Done.

[(0, 'movie_id', 'integer', 1, None, 1),
 (1, 'title', 'varchar(500)', 0, 'NULL', 0),
 (2, 'release_date', 'datetime(6)', 0, 'NULL', 0),
 (3, 'budget', 'integer', 0, 'NULL', 0),
 (4, 'homepage', 'varchar(500)', 0, 'NULL', 0),
 (5, 'original_language', 'varchar(50)', 0, 'NULL', 0),
 (6, 'original_title', 'varchar(500)', 0, 'NULL', 0),
 (7, 'overview', 'varchar(5000)', 0, 'NULL', 0),
 (8, 'popularity', 'double', 0, 'NULL', 0),
 (9, 'revenue', 'double', 0, 'NULL', 0),
 (10, 'runtime', 'double', 0, 'NULL', 0),
 (11, 'release_status', 'varchar(50)', 0, 'NULL', 0),
 (12, 'tagline', 'varchar(500)', 0, 'NULL', 0),
 (13, 'vote_average', 'double', 0, 'NULL', 0),
 (14, 'vote_count', 'integer', 0, 'NULL', 0)]

**Question 2**

How many foreign keys does the “LanguageMap” table have?

**Options:**

 - 0
 - 2
 - 3
 - 1

**Solution**

In [4]:
%%sql 
pragma table_info ('LanguageMap');

 * sqlite:///TMDB.db
Done.

[(0, 'movie_id', 'integer', 1, None, 1),
 (1, 'iso_639_1', 'char(2)', 1, None, 2)]

**Question 3**

How many movies in the database were produced by Pixar Animation Studios?

**Options:**
 - 16
 - 14
 - 18
 - 20

**Solution**

In [5]:
%%sql 
SELECT count(movies.movie_id) 
AS OUR_RESULT FROM productioncompanies 
INNER JOIN productioncompanymap 
ON productioncompanies.production_company_id=productioncompanymap.production_company_id 
INNER JOIN movies ON productioncompanymap.movie_id=movies.movie_id 
WHERE productioncompanies.production_company_name="Pixar Animation Studios";

 * sqlite:///TMDB.db
Done.

[(16,)]

**Question 4**

What is the most popular action movie that has some German in it? (Hint: The German word for German is Deutsch)

**Options:**
 - The Bourne Identity
 - Mission: Impossible - Rogue Nation
 - Captain America: Civil War
 - Quantum of Solace

**Solution**

In [6]:
%%sql 
SELECT MAX(popularity), title
FROM movies
INNER JOIN genremap
ON genremap.movie_id = movies.movie_id
INNER JOIN	genres
ON genres.genre_id = genremap.genre_id
INNER JOIN languagemap
ON languagemap.movie_id = movies.movie_id
WHERE  languagemap.iso_639_1 = 'de';

 * sqlite:///TMDB.db
Done.

[(198.372395, 'Captain America: Civil War')]

**Question 5**

In how many movies did Tom Cruise portray the character Ethan Hunt? (Hint: Characters are listed in the Casts table.)

**Options:**
 - 4
 - 3
 - 6
 - 5

**Solution**

In [7]:
%%sql 

SELECT COUNT(casts.characters) 
AS "Tom Cruise Result" 
FROM movies INNER JOIN casts 
ON movies.movie_id=casts.movie_id 
INNER JOIN actors ON casts.actor_id=actors.actor_id 
WHERE casts.characters="Ethan Hunt" 
AND actors.actor_name="Tom Cruise";

 * sqlite:///TMDB.db
Done.

[(5,)]

**Question 6**

How many times was the actress Cate Blanchett nominated for an Oscar?
 
 **Options:**
 - 7
 - 4
 - 5
 - 2

**Solution**

In [8]:
%%sql 
SELECT COUNT(name) 
AS "Cate Blanchett Nominations" 
FROM oscars 
WHERE name="Cate Blanchett";

 * sqlite:///TMDB.db
Done.

[(7,)]

**Question 7**

How many of the TMDB database movies were nominated for the Best Picture award at the Oscars?
 
**Options:**

 - 12
 - 16
 - 8
 - 18

**Solution**

In [9]:
%%sql 
SELECT COUNT(*) 
AS "Best Picture Award Movies" 
FROM oscars INNER JOIN movies 
ON oscars.name=movies.title 
WHERE award="Best Picture";

 * sqlite:///TMDB.db
Done.

[(8,)]

**Question 8** 

How many movies contain at least one of the languages, Afrikaans or Zulu?

**Options:**
 - 10
 - 8
 - 12
 - 15

**Solution**

In [10]:
%%sql 
SELECT COUNT(DISTINCT movies.title) 
AS "Afrikaans and/or Zulu Movies" 
FROM movies INNER JOIN languagemap 
ON movies.movie_id=languagemap.movie_id INNER JOIN languages 
ON languagemap.iso_639_1=languages.iso_639_1 
WHERE languages.language_name LIKE "%Afrikaans%" 
OR languages.language_name LIKE "%Zulu%";

 * sqlite:///TMDB.db
Done.

[(8,)]

**Question 9**

In which country was the movie “Star Wars” produced?  

**Options:**
 - Canada
 - United Kingdom
 - France
 - United States of America

**Solution**

In [11]:
%%sql 
SELECT productioncountries.production_country_name 
FROM movies INNER JOIN productioncountrymap 
ON movies.movie_id=productioncountrymap.movie_id 
INNER JOIN productioncountries 
ON productioncountrymap.iso_3166_1=productioncountries.iso_3166_1 
WHERE movies.title="Star Wars";

 * sqlite:///TMDB.db
Done.

[('United States of America',)]

**Question 10**

How many movies are in the database that are both a Romance and a Comedy?

**Options:**

 - 373
 - 484
 - 262
 - 595

**Solution**

In [12]:
%%sql 
SELECT COUNT(*) 
AS "Intersection of Romance and Comedy Movies" 
FROM (SELECT movies.title FROM movies INNER JOIN genremap 
      ON movies.movie_id=genremap.movie_id INNER JOIN genres 
      ON genremap.genre_id=genres.genre_id WHERE genres.genre_name="Romance" 
      INTERSECT SELECT movies.title FROM movies INNER JOIN genremap 
      ON movies.movie_id=genremap.movie_id INNER JOIN genres 
      ON genremap.genre_id=genres.genre_id WHERE genres.genre_name="Comedy") intersection;

 * sqlite:///TMDB.db
Done.

[(484,)]